Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/iLLD/TC3xx/Tricore/_PinMap/TC38x/IfxGtm_PinMap_TC38x_LFBGA516.h
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P24_5_IN;  /**< \brief IfxGtm_TIM4_5_P24_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P25_13_IN;  /**< \brief IfxGtm_TIM4_5_P25_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P30_5_IN;  /**< \brief IfxGtm_TIM4_5_P30_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P33_14_IN;  /**< \brief IfxGtm_TIM4_5_P33_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P33_5_IN;  /**< \brief IfxGtm_TIM4_5_P33_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P01_14_IN;  /**< \brief IfxGtm_TIM4_6_P01_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P01_15_IN;  /**< \brief IfxGtm_TIM4_6_P01_15_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P01_4_IN;  /**< \brief IfxGtm_TIM4_6_P01_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P10_15_IN;  /**< \brief IfxGtm_TIM4_6_P10_15_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P10_3_IN;  /**< \brief IfxGtm_TIM4_6_P10_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P11_13_IN;  /**< \brief IfxGtm_TIM4_6_P11_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P15_15_IN;  /**< \brief IfxGtm_TIM4_6_P15_15_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P24_6_IN;  /**< \brief IfxGtm_TIM4_6_P24_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P25_14_IN;  /**< \brief IfxGtm_TIM4_6_P25_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P30_6_IN;  /**< \brief IfxGtm_TIM4_6_P30_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P33_15_IN;  /**< \brief IfxGtm_TIM4_6_P33_15_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P00_14_IN;  /**< \brief IfxGtm_TIM4_7_P00_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P01_11_IN;  /**< \brief IfxGtm_TIM4_7_P01_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P10_4_IN;  /**< \brief IfxGtm_TIM4_7_P10_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P11_14_IN;  /**< \brief IfxGtm_TIM4_7_P11_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P11_15_IN;  /**< \brief IfxGtm_TIM4_7_P11_15_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P13_9_IN;  /**< \brief IfxGtm_TIM4_7_P13_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P14_7_IN;  /**< \brief IfxGtm_TIM4_7_P14_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P24_7_IN;  /**< \brief IfxGtm_TIM4_7_P24_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P25_15_IN;  /**< \brief IfxGtm_TIM4_7_P25_15_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P30_7_IN;  /**< \brief IfxGtm_TIM4_7_P30_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P34_5_IN;  /**< \brief IfxGtm_TIM4_7_P34_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_0_P00_13_IN;  /**< \brief IfxGtm_TIM5_0_P00_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_0_P01_12_IN;  /**< \brief IfxGtm_TIM5_0_P01_12_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_0_P01_8_IN;  /**< \brief IfxGtm_TIM5_0_P01_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_0_P02_12_IN;  /**< \brief IfxGtm_TIM5_0_P02_12_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_0_P13_11_IN;  /**< \brief IfxGtm_TIM5_0_P13_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_0_P22_8_IN;  /**< \brief IfxGtm_TIM5_0_P22_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_0_P24_8_IN;  /**< \brief IfxGtm_TIM5_0_P24_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_0_P30_8_IN;  /**< \brief IfxGtm_TIM5_0_P30_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_0_P31_8_IN;  /**< \brief IfxGtm_TIM5_0_P31_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_0_P33_14_IN;  /**< \brief IfxGtm_TIM5_0_P33_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_1_P00_15_IN;  /**< \brief IfxGtm_TIM5_1_P00_15_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_1_P01_1_IN;  /**< \brief IfxGtm_TIM5_1_P01_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_1_P01_9_IN;  /**< \brief IfxGtm_TIM5_1_P01_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_1_P02_15_IN;  /**< \brief IfxGtm_TIM5_1_P02_15_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_1_P13_10_IN;  /**< \brief IfxGtm_TIM5_1_P13_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_1_P14_11_IN;  /**< \brief IfxGtm_TIM5_1_P14_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_1_P22_9_IN;  /**< \brief IfxGtm_TIM5_1_P22_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_1_P24_9_IN;  /**< \brief IfxGtm_TIM5_1_P24_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_1_P30_9_IN;  /**< \brief IfxGtm_TIM5_1_P30_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_1_P31_9_IN;  /**< \brief IfxGtm_TIM5_1_P31_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_1_P33_15_IN;  /**< \brief IfxGtm_TIM5_1_P33_15_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_2_P01_10_IN;  /**< \brief IfxGtm_TIM5_2_P01_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_2_P01_9_IN;  /**< \brief IfxGtm_TIM5_2_P01_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_2_P02_13_IN;  /**< \brief IfxGtm_TIM5_2_P02_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_2_P13_14_IN;  /**< \brief IfxGtm_TIM5_2_P13_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_2_P14_14_IN;  /**< \brief IfxGtm_TIM5_2_P14_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_2_P22_10_IN;  /**< \brief IfxGtm_TIM5_2_P22_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_2_P24_10_IN;  /**< \brief IfxGtm_TIM5_2_P24_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_2_P30_10_IN;  /**< \brief IfxGtm_TIM5_2_P30_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_2_P31_10_IN;  /**< \brief IfxGtm_TIM5_2_P31_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_3_P01_11_IN;  /**< \brief IfxGtm_TIM5_3_P01_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_3_P01_13_IN;  /**< \brief IfxGtm_TIM5_3_P01_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_3_P01_5_IN;  /**< \brief IfxGtm_TIM5_3_P01_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_3_P02_14_IN;  /**< \brief IfxGtm_TIM5_3_P02_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_3_P13_4_IN;  /**< \brief IfxGtm_TIM5_3_P13_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_3_P14_13_IN;  /**< \brief IfxGtm_TIM5_3_P14_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_3_P22_11_IN;  /**< \brief IfxGtm_TIM5_3_P22_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_3_P24_11_IN;  /**< \brief IfxGtm_TIM5_3_P24_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_3_P30_11_IN;  /**< \brief IfxGtm_TIM5_3_P30_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_3_P31_11_IN;  /**< \brief IfxGtm_TIM5_3_P31_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_3_P34_1_IN;  /**< \brief IfxGtm_TIM5_3_P34_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_4_P00_0_IN;  /**< \brief IfxGtm_TIM5_4_P00_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_4_P01_0_IN;  /**< \brief IfxGtm_TIM5_4_P01_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_4_P01_8_IN;  /**< \brief IfxGtm_TIM5_4_P01_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_4_P13_5_IN;  /**< \brief IfxGtm_TIM5_4_P13_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_4_P14_12_IN;  /**< \brief IfxGtm_TIM5_4_P14_12_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_4_P21_2_IN;  /**< \brief IfxGtm_TIM5_4_P21_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_4_P24_12_IN;  /**< \brief IfxGtm_TIM5_4_P24_12_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_4_P30_12_IN;  /**< \brief IfxGtm_TIM5_4_P30_12_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_4_P31_12_IN;  /**< \brief IfxGtm_TIM5_4_P31_12_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_4_P34_2_IN;  /**< \brief IfxGtm_TIM5_4_P34_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P00_1_IN;  /**< \brief IfxGtm_TIM5_5_P00_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P01_10_IN;  /**< \brief IfxGtm_TIM5_5_P01_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P01_2_IN;  /**< \brief IfxGtm_TIM5_5_P01_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P01_6_IN;  /**< \brief IfxGtm_TIM5_5_P01_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P13_13_IN;  /**< \brief IfxGtm_TIM5_5_P13_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P13_6_IN;  /**< \brief IfxGtm_TIM5_5_P13_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P21_3_IN;  /**< \brief IfxGtm_TIM5_5_P21_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P24_13_IN;  /**< \brief IfxGtm_TIM5_5_P24_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P30_13_IN;  /**< \brief IfxGtm_TIM5_5_P30_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P31_13_IN;  /**< \brief IfxGtm_TIM5_5_P31_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P32_5_IN;  /**< \brief IfxGtm_TIM5_5_P32_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P34_3_IN;  /**< \brief IfxGtm_TIM5_5_P34_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P00_2_IN;  /**< \brief IfxGtm_TIM5_6_P00_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P01_14_IN;  /**< \brief IfxGtm_TIM5_6_P01_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P01_15_IN;  /**< \brief IfxGtm_TIM5_6_P01_15_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P01_6_IN;  /**< \brief IfxGtm_TIM5_6_P01_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P13_7_IN;  /**< \brief IfxGtm_TIM5_6_P13_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P14_15_IN;  /**< \brief IfxGtm_TIM5_6_P14_15_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P21_4_IN;  /**< \brief IfxGtm_TIM5_6_P21_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P24_14_IN;  /**< \brief IfxGtm_TIM5_6_P24_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P30_14_IN;  /**< \brief IfxGtm_TIM5_6_P30_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P31_14_IN;  /**< \brief IfxGtm_TIM5_6_P31_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P32_6_IN;  /**< \brief IfxGtm_TIM5_6_P32_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P34_4_IN;  /**< \brief IfxGtm_TIM5_6_P34_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_7_P00_14_IN;  /**< \brief IfxGtm_TIM5_7_P00_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_7_P00_3_IN;  /**< \brief IfxGtm_TIM5_7_P00_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_7_P01_11_IN;  /**< \brief IfxGtm_TIM5_7_P01_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_7_P01_7_IN;  /**< \brief IfxGtm_TIM5_7_P01_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_7_P13_15_IN;  /**< \brief IfxGtm_TIM5_7_P13_15_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_7_P21_5_IN;  /**< \brief IfxGtm_TIM5_7_P21_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_7_P24_15_IN;  /**< \brief IfxGtm_TIM5_7_P24_15_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_7_P30_15_IN;  /**< \brief IfxGtm_TIM5_7_P30_15_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_7_P31_15_IN;  /**< \brief IfxGtm_TIM5_7_P31_15_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_7_P32_7_IN;  /**< \brief IfxGtm_TIM5_7_P32_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_7_P34_5_IN;  /**< \brief IfxGtm_TIM5_7_P34_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_0_P01_12_IN;  /**< \brief IfxGtm_TIM6_0_P01_12_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_0_P10_9_IN;  /**< \brief IfxGtm_TIM6_0_P10_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_0_P13_4_IN;  /**< \brief IfxGtm_TIM6_0_P13_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_0_P20_6_IN;  /**< \brief IfxGtm_TIM6_0_P20_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_0_P23_7_IN;  /**< \brief IfxGtm_TIM6_0_P23_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_0_P24_0_IN;  /**< \brief IfxGtm_TIM6_0_P24_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_0_P25_0_IN;  /**< \brief IfxGtm_TIM6_0_P25_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_0_P30_8_IN;  /**< \brief IfxGtm_TIM6_0_P30_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_0_P31_8_IN;  /**< \brief IfxGtm_TIM6_0_P31_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_1_P01_13_IN;  /**< \brief IfxGtm_TIM6_1_P01_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_1_P10_10_IN;  /**< \brief IfxGtm_TIM6_1_P10_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_1_P13_5_IN;  /**< \brief IfxGtm_TIM6_1_P13_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_1_P20_7_IN;  /**< \brief IfxGtm_TIM6_1_P20_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_1_P23_6_IN;  /**< \brief IfxGtm_TIM6_1_P23_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_1_P24_1_IN;  /**< \brief IfxGtm_TIM6_1_P24_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_1_P25_1_IN;  /**< \brief IfxGtm_TIM6_1_P25_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_1_P30_9_IN;  /**< \brief IfxGtm_TIM6_1_P30_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_1_P31_9_IN;  /**< \brief IfxGtm_TIM6_1_P31_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_2_P01_14_IN;  /**< \brief IfxGtm_TIM6_2_P01_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_2_P10_11_IN;  /**< \brief IfxGtm_TIM6_2_P10_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_2_P13_6_IN;  /**< \brief IfxGtm_TIM6_2_P13_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_2_P20_8_IN;  /**< \brief IfxGtm_TIM6_2_P20_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_2_P23_5_IN;  /**< \brief IfxGtm_TIM6_2_P23_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_2_P24_2_IN;  /**< \brief IfxGtm_TIM6_2_P24_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_2_P25_2_IN;  /**< \brief IfxGtm_TIM6_2_P25_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_2_P30_10_IN;  /**< \brief IfxGtm_TIM6_2_P30_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_2_P31_10_IN;  /**< \brief IfxGtm_TIM6_2_P31_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_3_P01_15_IN;  /**< \brief IfxGtm_TIM6_3_P01_15_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_3_P10_13_IN;  /**< \brief IfxGtm_TIM6_3_P10_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_3_P13_7_IN;  /**< \brief IfxGtm_TIM6_3_P13_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_3_P20_9_IN;  /**< \brief IfxGtm_TIM6_3_P20_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_3_P23_4_IN;  /**< \brief IfxGtm_TIM6_3_P23_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_3_P24_3_IN;  /**< \brief IfxGtm_TIM6_3_P24_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_3_P25_3_IN;  /**< \brief IfxGtm_TIM6_3_P25_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_3_P30_11_IN;  /**< \brief IfxGtm_TIM6_3_P30_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_3_P31_11_IN;  /**< \brief IfxGtm_TIM6_3_P31_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_4_P00_4_IN;  /**< \brief IfxGtm_TIM6_4_P00_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_4_P13_9_IN;  /**< \brief IfxGtm_TIM6_4_P13_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_4_P14_12_IN;  /**< \brief IfxGtm_TIM6_4_P14_12_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_4_P23_3_IN;  /**< \brief IfxGtm_TIM6_4_P23_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_4_P24_4_IN;  /**< \brief IfxGtm_TIM6_4_P24_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_4_P25_4_IN;  /**< \brief IfxGtm_TIM6_4_P25_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_4_P30_12_IN;  /**< \brief IfxGtm_TIM6_4_P30_12_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_4_P31_12_IN;  /**< \brief IfxGtm_TIM6_4_P31_12_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_5_P00_13_IN;  /**< \brief IfxGtm_TIM6_5_P00_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_5_P13_10_IN;  /**< \brief IfxGtm_TIM6_5_P13_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_5_P14_13_IN;  /**< \brief IfxGtm_TIM6_5_P14_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_5_P23_2_IN;  /**< \brief IfxGtm_TIM6_5_P23_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_5_P24_5_IN;  /**< \brief IfxGtm_TIM6_5_P24_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_5_P25_5_IN;  /**< \brief IfxGtm_TIM6_5_P25_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_5_P30_13_IN;  /**< \brief IfxGtm_TIM6_5_P30_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_5_P31_13_IN;  /**< \brief IfxGtm_TIM6_5_P31_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_6_P00_14_IN;  /**< \brief IfxGtm_TIM6_6_P00_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_6_P13_11_IN;  /**< \brief IfxGtm_TIM6_6_P13_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_6_P14_14_IN;  /**< \brief IfxGtm_TIM6_6_P14_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_6_P23_1_IN;  /**< \brief IfxGtm_TIM6_6_P23_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_6_P24_6_IN;  /**< \brief IfxGtm_TIM6_6_P24_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_6_P25_6_IN;  /**< \brief IfxGtm_TIM6_6_P25_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_6_P26_0_IN;  /**< \brief IfxGtm_TIM6_6_P26_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_6_P30_14_IN;  /**< \brief IfxGtm_TIM6_6_P30_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_6_P31_14_IN;  /**< \brief IfxGtm_TIM6_6_P31_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_7_P00_15_IN;  /**< \brief IfxGtm_TIM6_7_P00_15_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_7_P13_12_IN;  /**< \brief IfxGtm_TIM6_7_P13_12_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_7_P14_15_IN;  /**< \brief IfxGtm_TIM6_7_P14_15_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_7_P23_0_IN;  /**< \brief IfxGtm_TIM6_7_P23_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_7_P24_7_IN;  /**< \brief IfxGtm_TIM6_7_P24_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_7_P25_7_IN;  /**< \brief IfxGtm_TIM6_7_P25_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_7_P30_15_IN;  /**< \brief IfxGtm_TIM6_7_P30_15_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM6_7_P31_15_IN;  /**< \brief IfxGtm_TIM6_7_P31_15_IN */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_0N_TOUT106_P10_4_OUT;  /**< \brief IfxGtm_TOM0_0N_TOUT106_P10_4_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_0N_TOUT17_P00_8_OUT;  /**< \brief IfxGtm_TOM0_0N_TOUT17_P00_8_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_0N_TOUT25_P33_3_OUT;  /**< \brief IfxGtm_TOM0_0N_TOUT25_P33_3_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_0N_TOUT34_P33_12_OUT;  /**< \brief IfxGtm_TOM0_0N_TOUT34_P33_12_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_0N_TOUT51_P21_0_OUT;  /**< \brief IfxGtm_TOM0_0N_TOUT51_P21_0_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_0N_TOUT61_P20_3_OUT;  /**< \brief IfxGtm_TOM0_0N_TOUT61_P20_3_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_0N_TOUT72_P15_1_OUT;  /**< \brief IfxGtm_TOM0_0N_TOUT72_P15_1_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_0N_TOUT7_P02_7_OUT;  /**< \brief IfxGtm_TOM0_0N_TOUT7_P02_7_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_0N_TOUT91_P13_0_OUT;  /**< \brief IfxGtm_TOM0_0N_TOUT91_P13_0_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_0N_TOUT9_P00_0_OUT;  /**< \brief IfxGtm_TOM0_0N_TOUT9_P00_0_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_0_TOUT0_P02_0_OUT;  /**< \brief IfxGtm_TOM0_0_TOUT0_P02_0_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_0_TOUT109_P10_7_OUT;  /**< \brief IfxGtm_TOM0_0_TOUT109_P10_7_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_0_TOUT151_P02_12_OUT;  /**< \brief IfxGtm_TOM0_0_TOUT151_P02_12_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_0_TOUT18_P00_9_OUT;  /**< \brief IfxGtm_TOM0_0_TOUT18_P00_9_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_0_TOUT26_P33_4_OUT;  /**< \brief IfxGtm_TOM0_0_TOUT26_P33_4_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_0_TOUT32_P33_10_OUT;  /**< \brief IfxGtm_TOM0_0_TOUT32_P33_10_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_0_TOUT53_P21_2_OUT;  /**< \brief IfxGtm_TOM0_0_TOUT53_P21_2_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_0_TOUT76_P15_5_OUT;  /**< \brief IfxGtm_TOM0_0_TOUT76_P15_5_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_0_TOUT77_P15_6_OUT;  /**< \brief IfxGtm_TOM0_0_TOUT77_P15_6_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_0_TOUT85_P14_5_OUT;  /**< \brief IfxGtm_TOM0_0_TOUT85_P14_5_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_0_TOUT87_P14_7_OUT;  /**< \brief IfxGtm_TOM0_0_TOUT87_P14_7_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_10_TOUT12_P00_3_OUT;  /**< \brief IfxGtm_TOM0_10_TOUT12_P00_3_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_10_TOUT2_P02_2_OUT;  /**< \brief IfxGtm_TOM0_10_TOUT2_P02_2_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_10_TOUT41_P23_0_OUT;  /**< \brief IfxGtm_TOM0_10_TOUT41_P23_0_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_10_TOUT46_P23_5_OUT;  /**< \brief IfxGtm_TOM0_10_TOUT46_P23_5_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_10_TOUT96_P11_3_OUT;  /**< \brief IfxGtm_TOM0_10_TOUT96_P11_3_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_11_TOUT13_P00_4_OUT;  /**< \brief IfxGtm_TOM0_11_TOUT13_P00_4_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_11_TOUT3_P02_3_OUT;  /**< \brief IfxGtm_TOM0_11_TOUT3_P02_3_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_11_TOUT43_P23_2_OUT;  /**< \brief IfxGtm_TOM0_11_TOUT43_P23_2_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_11_TOUT49_P22_2_OUT;  /**< \brief IfxGtm_TOM0_11_TOUT49_P22_2_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_11_TOUT97_P11_6_OUT;  /**< \brief IfxGtm_TOM0_11_TOUT97_P11_6_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_12_TOUT14_P00_5_OUT;  /**< \brief IfxGtm_TOM0_12_TOUT14_P00_5_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_12_TOUT44_P23_3_OUT;  /**< \brief IfxGtm_TOM0_12_TOUT44_P23_3_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_12_TOUT4_P02_4_OUT;  /**< \brief IfxGtm_TOM0_12_TOUT4_P02_4_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_12_TOUT50_P22_3_OUT;  /**< \brief IfxGtm_TOM0_12_TOUT50_P22_3_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_12_TOUT98_P11_9_OUT;  /**< \brief IfxGtm_TOM0_12_TOUT98_P11_9_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_13_TOUT15_P00_6_OUT;  /**< \brief IfxGtm_TOM0_13_TOUT15_P00_6_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_13_TOUT5_P02_5_OUT;  /**< \brief IfxGtm_TOM0_13_TOUT5_P02_5_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_13_TOUT99_P11_10_OUT;  /**< \brief IfxGtm_TOM0_13_TOUT99_P11_10_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_14_TOUT100_P11_11_OUT;  /**< \brief IfxGtm_TOM0_14_TOUT100_P11_11_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_14_TOUT16_P00_7_OUT;  /**< \brief IfxGtm_TOM0_14_TOUT16_P00_7_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_14_TOUT6_P02_6_OUT;  /**< \brief IfxGtm_TOM0_14_TOUT6_P02_6_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_15_TOUT101_P11_12_OUT;  /**< \brief IfxGtm_TOM0_15_TOUT101_P11_12_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_15_TOUT17_P00_8_OUT;  /**< \brief IfxGtm_TOM0_15_TOUT17_P00_8_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_15_TOUT42_P23_1_OUT;  /**< \brief IfxGtm_TOM0_15_TOUT42_P23_1_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_15_TOUT7_P02_7_OUT;  /**< \brief IfxGtm_TOM0_15_TOUT7_P02_7_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_1N_TOUT107_P10_5_OUT;  /**< \brief IfxGtm_TOM0_1N_TOUT107_P10_5_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_1N_TOUT10_P00_1_OUT;  /**< \brief IfxGtm_TOM0_1N_TOUT10_P00_1_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_1N_TOUT14_P00_5_OUT;  /**< \brief IfxGtm_TOM0_1N_TOUT14_P00_5_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_1N_TOUT22_P33_0_OUT;  /**< \brief IfxGtm_TOM0_1N_TOUT22_P33_0_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_1N_TOUT30_P33_8_OUT;  /**< \brief IfxGtm_TOM0_1N_TOUT30_P33_8_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_1N_TOUT35_P33_13_OUT;  /**< \brief IfxGtm_TOM0_1N_TOUT35_P33_13_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_1N_TOUT39_P32_3_OUT;  /**< \brief IfxGtm_TOM0_1N_TOUT39_P32_3_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_1N_TOUT4_P02_4_OUT;  /**< \brief IfxGtm_TOM0_1N_TOUT4_P02_4_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_1N_TOUT52_P21_1_OUT;  /**< \brief IfxGtm_TOM0_1N_TOUT52_P21_1_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_1N_TOUT57_P21_6_OUT;  /**< \brief IfxGtm_TOM0_1N_TOUT57_P21_6_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_1N_TOUT73_P15_2_OUT;  /**< \brief IfxGtm_TOM0_1N_TOUT73_P15_2_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_1N_TOUT90_P14_10_OUT;  /**< \brief IfxGtm_TOM0_1N_TOUT90_P14_10_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_1N_TOUT92_P13_1_OUT;  /**< \brief IfxGtm_TOM0_1N_TOUT92_P13_1_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_1_TOUT103_P10_1_OUT;  /**< \brief IfxGtm_TOM0_1_TOUT103_P10_1_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_1_TOUT116_P02_9_OUT;  /**< \brief IfxGtm_TOM0_1_TOUT116_P02_9_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_1_TOUT19_P00_10_OUT;  /**< \brief IfxGtm_TOM0_1_TOUT19_P00_10_OUT */
IFX_EXTERN IfxGtm_Tom_ToutMap IfxGtm_TOM0_1_TOUT1_P02_1_OUT;  /**< \brief IfxGtm_TOM0_1_TOUT1_P02_1_OUT */
